Updated md for users
